Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.AreElementsValidIntersectingReferences(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Identifies if provided members are valid.
document:
The document.
elementIds:
Element ids to be tested for validity for intersecting references.
Returns:
True if all references are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.AreElementsValidIntersectingReferences(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Identifies if provided members are valid.
elementIds:
Element ids to be tested for validity for intersecting references.
Returns:
True if all references are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.GetSketchCurves(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve}@)
Populates the array with copies of curves in the sketch.
curveArray:
Curves in the sketch. Tags of the curves are consistent with the curve tags
used in part keys.
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionRuleId
Id of the 'DivisionRule' which is used to augment the cutting sketch.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013